app/controllers/photos_controller.rb

  def add
    begin
      photo = params[:photo]
      filter_info = params[:filter_info]

      p = Photo.new(:description => params[:description])
      p.save
---
INSERT INTO `photos` (`content_type`, `created_at`, `del_flg`, `description`, `filename`, `height`, `isvalid`, `md5`, `orig_filename`, `parent_id`, `partition`, `photoable_id`, `photoable_type`, `size`, `thumbnail`, `updated_at`, `upload_filename`, `user_id`, `validated`, `width`) VALUES (NULL, '2013-03-29 05:40:40', 0, 'hello world', NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2013-03-29 05:40:40', NULL, NULL, 0, NULL)